import React from 'react';

import {
  ContentContainer,
  ContentImage,
  ContentParagraph,
  ContentTitle,
} from 'modules/about-us/components/ContentSection/styled';

function ContentSection(): JSX.Element {
  return (
    <ContentContainer>
      <ContentTitle>ประวัติภาควิชาฯ</ContentTitle>
      <ContentImage src="/images/history_banner.png" alt="" />
      <ContentParagraph>
        ภาควิชาวิศวกรรมคอมพิวเตอร์ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี
        เริ่มก่อตั้ง และเปิดสอนในระดับปริญญาตรีตั้งแต่ปีการศึกษา 2531
        แต่ได้รับการอนุมัติให้จัดตั้งหน่วยงาน ภาควิชาวิศวกรรมคอมพิวเตอร์
        และประกาศในพระราชกฤษฎีกา เมื่อวันที่ 11 กุมภาพันธ์ 2540
      </ContentParagraph>
      <ContentParagraph>
        ภาควิชาวิศวกรรมคอมพิวเตอร์ เปิดสอนทั้งในระดับปริญญาตรี ปริญญาโท และปริญญาเอก
        โดยในระดับปริญญาตรี แบ่งเป็น 2 หลักสูตร คือ หลักสูตรวิศวกรรมศาสตรบัณฑิต
        สาขาวิชาวิศวกรรมคอมพิวเตอร์(ปกติ) และหลักสูตรวิศวกรรมศาสตรบัณฑิต
        สาขาวิศวกรรมคอมพิวเตอร์ (หลักสูตรนานาชาติ) ส่วนในระดับปริญญาโท คือ
        หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต และวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์
        และในระดับปริญญาเอก คือ หลักสูตรปรัชญาดุษฎีบัณฑิต
        สาขาวิชาวิศวกรรมไฟฟ้าและคอมพิวเตอร์
      </ContentParagraph>
      <ContentParagraph>
        {' '}
        วัตถุประสงค์หลักของภาควิชาวิศวกรรมคอมพิวเตอร์ คือ
        การมุ่งผลิตวิศวกรคอมพิวเตอร์ที่มีความรู้ความสามารถในการคิด การออกแบบ
        และการประยุกต์ใช้งาน ทั้งซอฟต์แวร์ ฮาร์ดแวร์ และโครงข่าย
        อันเป็นรากฐานสำคัญของระบบเทคโนโลยีและการสื่อสาร
        วิศวกรคอมพิวเตอร์จะต้องสามารถเรียนรู้เทคโนโลยีใหม่ๆ ได้ด้วยตนเอง
        และเรียนรู้ได้ตลอดชีวิต การเรียนการสอนของภาควิชาฯ
        จึงเน้นแบบการเรียนรู้ในการแก้ปัญหาด้วยตนเอง(Problem Based Learning)
        โดยมีอาจารย์ผู้สอนเป็นผู้ให้คำปรึกษา นักศึกษาต้องทำงานเป็นกลุ่ม
        และมีการนำเสนอผลงานของตนเองให้เพื่อนๆ ร่วมกันวิเคราะห์และวิจารณ์อย่างมีเหตุผล
        ซึ่งจะทำให้วิศวกรคอมพิวเตอร์ที่สำเร็จการศึกษาจากภาควิชาฯ
        เป็นผู้ที่มีความรู้ที่แข็งแกร่ง มีทักษะ
        และสามารถปรับตัวให้เข้ากับการทำงานได้ในทุกองค์กร
      </ContentParagraph>
    </ContentContainer>
  );
}

export default ContentSection;
