import { GetHomeQuery } from 'common/generated/generated-types';

import { useHomeContentParser } from 'modules/home/hooks/useHomeContentParser';

const MOCK_API: GetHomeQuery = {
  home: {
    main_canvas: [
      {
        _id: '62572ae54f6cce008ea49e15',
        title: 'หัวข้อ 1',
        news_announcement: {
          _id: '625304b36079e600207d6bf6',
          seo_link: 'general-1',
        },
        description:
          '<p>พ่อค้าสติกเกอร์ไงโฮปบาบูน ธุหร่ำ แบรนด์สตรอว์เบอร์รีเทคโนแครตดีเจคาสิโน ออยล์โปสเตอร์สตริงควีน ดีไซน์แจ็กพ็อตสมาพันธ์เบลอเมี่ยงคำ สแตนดาร์ดโมหจริต ไกด์เยนเปราะบางโปลิศ ปัจเจกชนสหัชญาณฟยอร์ด สถาปัตย์แพนงเชิญจ๊าบแฟนซี คัตเอาต์โอเวอร์ ต่อรองบริกรออดิทอเรียม โปรดักชั่น แบคโฮแทงกั๊กแทงกั๊กเอ๋ อุด้งหมั่นโถวกฤษณ์ อิกัวนาอาข่ารีโมต ซานตาคลอสอุด้งแรงดูดเวิร์กช็อปมาเฟีย</p>\n<p>เจ๊าะแจ๊ะดราม่าเซฟตี้ไลฟ์ มวลชนฟรังก์บู๊แพนงเชิญวัจนะ เปโซราชบัณฑิตยสถานฮาร์ดคณาญาติรามาธิบดี โอเวอร์เทอร์โบโปรดิวเซอร์รีสอร์ตสไตรค์ อุปนายกแรงผลักไฮเทคแอดมิสชันมะกัน ออร์แกนแจ๊กเก็ต โปรเจ็คคณาญาติติวภควัมปติ เอสเปรสโซงั้นดีพาร์ทเมนท์โลชั่น คอมพ์วันเวย์ ดีไซน์เนอร์อิออนรีดไถสแล็กแฟลช เซรามิก วโรกาส โปรเจ็คท์เห่ย นายแบบเรซินแชเชือนชินบัญชร โฮม บลอนด์ไคลแมกซ์</p>',
        image: {
          url:
            '/uploads/pleased_handsome_businessman_pointing_person_making_good_point_nice_job_praising_employee_saying_well_done_176420_21751_de32e57fc8.webp',
        },
      },
      {
        _id: '62572ae54f6cce008ea49e16',
        title: 'หัวข้อ 2',
        news_announcement: null,
        description:
          '<p>พ่อค้าสติกเกอร์ไงโฮปบาบูน ธุหร่ำ แบรนด์สตรอว์เบอร์รีเทคโนแครตดีเจคาสิโน ออยล์โปสเตอร์สตริงควีน ดีไซน์แจ็กพ็อตสมาพันธ์เบลอเมี่ยงคำ สแตนดาร์ดโมหจริต ไกด์เยนเปราะบางโปลิศ ปัจเจกชนสหัชญาณฟยอร์ด สถาปัตย์แพนงเชิญจ๊าบแฟนซี คัตเอาต์โอเวอร์ ต่อรองบริกรออดิทอเรียม โปรดักชั่น แบคโฮแทงกั๊กแทงกั๊กเอ๋ อุด้งหมั่นโถวกฤษณ์ อิกัวนาอาข่ารีโมต ซานตาคลอสอุด้งแรงดูดเวิร์กช็อปมาเฟีย</p>\n<p>เจ๊าะแจ๊ะดราม่าเซฟตี้ไลฟ์ มวลชนฟรังก์บู๊แพนงเชิญวัจนะ เปโซราชบัณฑิตยสถานฮาร์ดคณาญาติรามาธิบดี โอเวอร์เทอร์โบโปรดิวเซอร์รีสอร์ตสไตรค์ อุปนายกแรงผลักไฮเทคแอดมิสชันมะกัน ออร์แกนแจ๊กเก็ต โปรเจ็คคณาญาติติวภควัมปติ เอสเปรสโซงั้นดีพาร์ทเมนท์โลชั่น คอมพ์วันเวย์ ดีไซน์เนอร์อิออนรีดไถสแล็กแฟลช เซรามิก วโรกาส โปรเจ็คท์เห่ย นายแบบเรซินแชเชือนชินบัญชร โฮม บลอนด์ไคลแมกซ์</p>',
        image: {
          url: '/uploads/95_953450_man_man_with_laptop_png_45a5addb23.jpg',
        },
      },
    ],
    activities_n_awards: [
      {
        _id: '62572ae54f6cce008ea49e1b',
        title: 'ทีมอะไรไม่รู้คว้า NSC',
        description:
          '<p>พ่อค้าสติกเกอร์ไงโฮปบาบูน ธุหร่ำ แบรนด์สตรอว์เบอร์รีเทคโนแครตดีเจคาสิโน ออยล์โปสเตอร์สตริงควีน ดีไซน์แจ็กพ็อตสมาพันธ์เบลอเมี่ยงคำ สแตนดาร์ดโมหจริต ไกด์เยนเปราะบางโปลิศ ปัจเจกชนสหัชญาณฟยอร์ด สถาปัตย์แพนงเชิญจ๊าบแฟนซี คัตเอาต์โอเวอร์ ต่อรองบริกรออดิทอเรียม โปรดักชั่น แบคโฮแทงกั๊กแทงกั๊กเอ๋ อุด้งหมั่นโถวกฤษณ์ อิกัวนาอาข่ารีโมต ซานตาคลอสอุด้งแรงดูดเวิร์กช็อปมาเฟีย</p>\n<p>เจ๊าะแจ๊ะดราม่าเซฟตี้ไลฟ์ มวลชนฟรังก์บู๊แพนงเชิญวัจนะ เปโซราชบัณฑิตยสถานฮาร์ดคณาญาติรามาธิบดี โอเวอร์เทอร์โบโปรดิวเซอร์รีสอร์ตสไตรค์ อุปนายกแรงผลักไฮเทคแอดมิสชันมะกัน ออร์แกนแจ๊กเก็ต โปรเจ็คคณาญาติติวภควัมปติ เอสเปรสโซงั้นดีพาร์ทเมนท์โลชั่น คอมพ์วันเวย์ ดีไซน์เนอร์อิออนรีดไถสแล็กแฟลช เซรามิก วโรกาส โปรเจ็คท์เห่ย นายแบบเรซินแชเชือนชินบัญชร โฮม บลอนด์ไคลแมกซ์</p>',
        image: {
          url: '/uploads/3122160_4509b093ee.jpeg',
        },
        tag: {
          _id: '6255c57c32795a000f76d8f1',
          tag_name: 'กิจกรรมนักศึกษา',
        },
      },
      {
        _id: '62572ae54f6cce008ea49e1c',
        title: 'กิจกรรม',
        description:
          '<p>พ่อค้าสติกเกอร์ไงโฮปบาบูน ธุหร่ำ แบรนด์สตรอว์เบอร์รีเทคโนแครตดีเจคาสิโน ออยล์โปสเตอร์สตริงควีน ดีไซน์แจ็กพ็อตสมาพันธ์เบลอเมี่ยงคำ สแตนดาร์ดโมหจริต ไกด์เยนเปราะบางโปลิศ ปัจเจกชนสหัชญาณฟยอร์ด สถาปัตย์แพนงเชิญจ๊าบแฟนซี คัตเอาต์โอเวอร์ ต่อรองบริกรออดิทอเรียม โปรดักชั่น แบคโฮแทงกั๊กแทงกั๊กเอ๋ อุด้งหมั่นโถวกฤษณ์ อิกัวนาอาข่ารีโมต ซานตาคลอสอุด้งแรงดูดเวิร์กช็อปมาเฟีย</p>\n<p>เจ๊าะแจ๊ะดราม่าเซฟตี้ไลฟ์ มวลชนฟรังก์บู๊แพนงเชิญวัจนะ เปโซราชบัณฑิตยสถานฮาร์ดคณาญาติรามาธิบดี โอเวอร์เทอร์โบโปรดิวเซอร์รีสอร์ตสไตรค์ อุปนายกแรงผลักไฮเทคแอดมิสชันมะกัน ออร์แกนแจ๊กเก็ต โปรเจ็คคณาญาติติวภควัมปติ เอสเปรสโซงั้นดีพาร์ทเมนท์โลชั่น คอมพ์วันเวย์ ดีไซน์เนอร์อิออนรีดไถสแล็กแฟลช เซรามิก วโรกาส โปรเจ็คท์เห่ย นายแบบเรซินแชเชือนชินบัญชร โฮม บลอนด์ไคลแมกซ์</p>',
        image: {
          url:
            '/uploads/group_asia_young_creative_people_smart_casual_wear_smiling_thumbs_up_creative_office_workplace_7861_3148_8971e8f113.webp',
        },
        tag: null,
      },
    ],
  },
  newsAndAnnouncements: [
    {
      _id: '6255d2b513263b000ef44bd4',
      header: 'ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3',
      canvas_preview: {
        url: '/uploads/Screen_Shot_2565_04_10_at_01_25_36_640b8cdc10.png',
      },
      tags: [
        {
          tag_id: 'freshmen_th',
          tag_name: 'นักศึกษาใหม่',
          seo_link: 'freshmen',
        },
      ],
      dynamic_content: [
        {
          __typename: 'ComponentContentSectionsTextContent',
          body:
            '<p>ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 3</p>',
        },
      ],
      createdAt: '2022-04-12T19:27:49.842Z',
    },
    {
      _id: '625304b36079e600207d6bf6',
      header: 'ข่าวสารทั่วไป 1',
      canvas_preview: null,
      tags: [
        {
          tag_id: 'activities_th',
          tag_name: 'กิจกรรมนักศึกษา',
          seo_link: 'activities',
        },
      ],
      dynamic_content: [
        {
          __typename: 'ComponentContentSectionsTextContent',
          body:
            '<h1>ทดสอบข่าวสารทั่วไป</h1>\n<p>ซ้าย</p>\n<p style="text-align: center;">กลาง</p>\n<p style="text-align: right;">ขวา</p>\n<p style="text-align: center;"><span style="color: rgb(132, 63, 161);">strikethorught</span></p>\n<p style="text-align: center;">&nbsp;</p>',
        },
      ],
      createdAt: '2022-04-10T16:24:19.498Z',
    },
    {
      _id: '6251d112d76d140063baec29',
      header: 'ประกาศรายชื่อผู้มีสิทธิ์สอบสัมภาษณ์ โครงการ Active Recruitment รอบที่ 2',
      canvas_preview: {
        url: '/uploads/Screen_Shot_2565_04_10_at_01_25_36_640b8cdc10.png',
      },
      tags: [],
      dynamic_content: [
        {
          __typename: 'ComponentContentSectionsTextContent',
          body:
            '<p>ภาควิชาวิศวกรรมคอมพิวเตอร์ คณะวิศวกรรมศาสตร์มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี เริ่มก่อตั้งและเปิดสอนในระดับปริญญาตรีตั้งแต่ปีการศึกษา 2531แต่ได้รับการอนุมัติให้จัดตั้งหน่วยงาน ภาควิชาวิศวกรรมคอมพิวเตอร์และประกาศในพระราชกฤษฎีกา เมื่อวันที่ 11 กุมภาพันธ์ 2540ภาควิชาวิศวกรรมคอมพิวเตอร์ เปิดสอนทั้งในระดับปริญญาตรี ปริญญาโท และปริญญาเอกโดยในระดับปริญญาตรี แบ่งเป็น 2 หลักสูตร คือ หลักสูตรวิศวกรรมศาสตรบัณฑิตสาขาวิชาวิศวกรรมคอมพิวเตอร์(ปกติ) และหลักสูตรวิศวกรรมศาสตรบัณฑิตสาขาวิศวกรรมคอมพิวเตอร์ (หลักสูตรนานาชาติ) ส่วนในระดับปริญญาโท คือหลักสูตรวิศวกรรมศาสตรมหาบัณฑิต และวิทยาศาสตรมหาบัณฑิตสาขาวิชาวิศวกรรมคอมพิวเตอร์ และในระดับปริญญาเอก คือ หลักสูตรปรัชญาดุษฎีบัณฑิตสาขาวิชาวิศวกรรมไฟฟ้าและคอมพิวเตอร์</p>',
        },
      ],
      createdAt: '2022-04-09T18:31:46.504Z',
    },
  ],
};

const MOCK_API_WITH_HTML_TAG: GetHomeQuery = {
  home: null,
  newsAndAnnouncements: [
    {
      _id: '63138e5ef1316e000e5d96bd',
      header: 'ทดสอบ',
      canvas_preview: {
        url: '/files/pexels-karolina-grabowska-4207708.jpg',
      },
      tags: [],
      dynamic_content: [
        {
          __typename: 'ComponentContentSectionsCarousalImage',
        },
        {
          __typename: 'ComponentContentSectionsTextContent',
          body:
            '<p>ทดสอบ</p>\n<p>&nbsp;</p>\n<p><img src="../../../../../files/pexels-karolina-grabowska-4041285.jpg" alt="" width="126" height="189"> <img src="../../../../../files/pexels-karolina-grabowska-4207708.jpg" alt="" width="128" height="192"></p>\n<p>&nbsp;</p>\n<p><em>test jaaa</em></p>\n<p>&nbsp;</p>',
        },
      ],
      createdAt: '2022-09-03T17:26:54.494Z',
    },
  ],
};
describe('useHomeContentParser', () => {
  it('should parese data correctly', () => {
    const { mainCarousal, activityAndAwardsCarousal, whatsNews } = useHomeContentParser(
      MOCK_API,
    );

    expect(mainCarousal[0].link).toEqual('/news/625304b36079e600207d6bf6');
    expect(mainCarousal[1].link).toBeUndefined();
    expect(activityAndAwardsCarousal.every((el) => el.link)).toBeTruthy();
    expect(whatsNews).toHaveLength(3);
  });

  it('shoudl parse description correctly with no HTML tag', () => {
    const { whatsNews } = useHomeContentParser(MOCK_API_WITH_HTML_TAG);
    const foundImageTag = whatsNews[0].description?.includes('<img>');
    expect(foundImageTag).toBe(false);
  });
});
